### Pandas Series

In [2]:
import numpy as np
import pandas as pd

# Series

It's a 1-dimensional labeled arrary it is like a one column in excel

### String in series

In [7]:
country = ["India", "Uk", "France", "Iseral", "USA"]

pd.Series(country)

0     India
1        Uk
2    France
3    Iseral
4       USA
dtype: object

### Integer in series

In [8]:
Marks = [10, 20, 30, 40, 50]

pd.Series(Marks)

0    10
1    20
2    30
3    40
4    50
dtype: int64

### Custom Indexing

In [9]:
marks = [70, 80, 90, 50, 60]
subjects = ["Maths", "chemestry", "English", "Hindi", "Physics"]

pd.Series(marks, index = subjects)

Maths        70
chemestry    80
English      90
Hindi        50
Physics      60
dtype: int64

In [11]:
pd.Series(marks, name = "Raj's Marks Chart", index = subjects)

Maths        70
chemestry    80
English      90
Hindi        50
Physics      60
Name: Raj's Marks Chart, dtype: int64

### By dictionary

In [15]:
marks = {
    "Maths": 80,
    "Physics": 90,
    "Chemistry": 92,
    "English": 89,
    "Hindi": 94,
    
}

marks_series = pd.Series(marks, name = "Rahul's Marks")
marks_series

Maths        80
Physics      90
Chemistry    92
English      89
Hindi        94
Name: Rahul's Marks, dtype: int64

In [24]:
#Size
marks_series.size

5

In [22]:
#dtype
marks_series.dtype

dtype('int64')

In [25]:
#name
marks_series.name

"Rahul's Marks"

In [32]:
#is_unique
marks_series.is_unique #True

pd.Series([1, 1, 2, 4, 6, 9]).is_unique #False

False

In [34]:
#index
marks_series.index

Index(['Maths', 'Physics', 'Chemistry', 'English', 'Hindi'], dtype='object')

In [35]:
#Values
marks_series.values

array([80, 90, 92, 89, 94])

In [35]:
subs = pd.read_csv("C:\\Jay\\Vs related files\\TDS-Virtual-TA\\Pandas\\subs.csv")
subs

     Subscribers gained
0                    48
1                    57
2                    40
3                    43
4                    44
..                  ...
360                 231
361                 226
362                 155
363                 144
364                 172

[365 rows x 1 columns]

In [27]:
pd.read_csv("C:\Jay\Vs related files\TDS-Virtual-TA\Pandas\kohli_ipl.csv")

<>:1: SyntaxWarning: invalid escape sequence '\J'
<>:1: SyntaxWarning: invalid escape sequence '\J'
C:\Users\Jay Rathore\AppData\Local\Temp\ipykernel_16928\1923333464.py:1: SyntaxWarning: invalid escape sequence '\J'
  pd.read_csv("C:\Jay\Vs related files\TDS-Virtual-TA\Pandas\kohli_ipl.csv")

     match_no  runs
0           1     1
1           2    23
2           3    13
3           4    12
4           5     1
..        ...   ...
210       211     0
211       212    20
212       213    73
213       214    25
214       215     7

[215 rows x 2 columns]

In [29]:
pd.read_csv("C:\\Jay\Vs related files\\TDS-Virtual-TA\\Pandas\\bollywood.csv")

<>:1: SyntaxWarning: invalid escape sequence '\V'
<>:1: SyntaxWarning: invalid escape sequence '\V'
C:\Users\Jay Rathore\AppData\Local\Temp\ipykernel_16928\3226661066.py:1: SyntaxWarning: invalid escape sequence '\V'
  pd.read_csv("C:\\Jay\Vs related files\\TDS-Virtual-TA\\Pandas\\bollywood.csv")

                                     movie              lead
0                 Uri: The Surgical Strike     Vicky Kaushal
1                            Battalion 609       Vicky Ahuja
2     The Accidental Prime Minister (film)       Anupam Kher
3                          Why Cheat India     Emraan Hashmi
4                          Evening Shadows  Mona Ambegaonkar
...                                    ...               ...
1495                Hum Tumhare Hain Sanam    Shah Rukh Khan
1496                   Aankhen (2002 film)  Amitabh Bachchan
1497                       Saathiya (film)      Vivek Oberoi
1498                        Company (film)        Ajay Devgn
1499                  Awara Paagal Deewana      Akshay Kumar

[1500 rows x 2 columns]

In [36]:
pd.__version__

'2.3.0'

In [37]:
list = [1, 2, 3, 4, 5]
print(list)

[1, 2, 3, 4, 5]

In [40]:
pd.Series(list)

0    1
1    2
2    3
3    4
4    5
dtype: int64

### Empty Series

In [41]:
empty = pd.Series([])
empty

Series([], dtype: object)

### Custom Index

In [44]:
a = ['p', "q", "r", "s", "t"]
pd.Series(a, index = [10, 20, 30, 40, 50], name = "Random Data")

10    p
20    q
30    r
40    s
50    t
Name: Random Data, dtype: object

### Scaler Series

In [46]:
Scaler_series = 0.5
pd.Series(Scaler_series, index = [1, 2, 3, 4, 5, 6, 7] )

1    0.5
2    0.5
3    0.5
4    0.5
5    0.5
6    0.5
7    0.5
dtype: float64

### Create Series with python dictionary

In [48]:
country = {
    "India": 3,
    "USA": 2,
    "France": 6,
    "UK": 7,
    "Autraliya": 3,
    "Russia": 4
    }

dict_series = pd.Series(country)
dict_series

India        3
USA          2
France       6
UK           7
Autraliya    3
Russia       4
dtype: int64

In [54]:
dict_series[0]

C:\Users\Jay Rathore\AppData\Local\Temp\ipykernel_16928\1198263229.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  dict_series[0]

np.int64(3)

In [56]:
dict_series[0:3]

India     3
USA       2
France    6
dtype: int64

In [53]:
max(dict_series)

7

In [3]:
# give list in a dictrionary
values = {
    'p': [1, 2, 3],
    'q': [4, 9, 8],
    'r': [4, 8, 9],
    's': [2, 6, 9]
}

dict_series = pd.Series(values)
dict_series

p    [1, 2, 3]
q    [4, 9, 8]
r    [4, 8, 9]
s    [2, 6, 9]
dtype: object

In [4]:
dict_series[0]

C:\Users\Jay Rathore\AppData\Local\Temp\ipykernel_14192\1198263229.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  dict_series[0]

[1, 2, 3]

In [6]:
dict_series[1][2]

C:\Users\Jay Rathore\AppData\Local\Temp\ipykernel_14192\322993233.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  dict_series[1][2]

8

In [7]:
max(dict_series)

[4, 9, 8]

In [9]:
grades = {"Semester1": 3.18, "Semester2": 3.28, "Semester3": 4.12}

dict_series = pd.Series(grades, index = ["Semester1", "Semester2"])
dict_series

Semester1    3.18
Semester2    3.28
dtype: float64

# DataFrame
it is 2 dimensional table of data and it is like a full excel sheet(rows * column)

In [11]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [12]:
list = [1, 2, 3, 4, 5]
df = pd.DataFrame(list)
print(df)

   0
0  1
1  2
2  3
3  4
4  5

In [13]:
list = [[1, 2, 3, 4, 5], [3, 6, 9,12, 15]]
df = pd.DataFrame(list)
print(df)

   0  1  2   3   4
0  1  2  3   4   5
1  3  6  9  12  15

In [17]:
dict = [{"a": 1, "b": 2, "c": 3, "d": 4, "e": 5, "f": 6},
        {"a": 3, "b": 6, "c": 9, "d": 5, "e": 5, "f": 9}]
df = pd.DataFrame(dict)
print(df)

   a  b  c  d  e  f
0  1  2  3  4  5  6
1  3  6  9  5  5  9

In [30]:
data = {'Roll Number': pd.Series([1, 2, 3, 4, 5]),
        "Name": pd.Series(["Jay", "Ram", "Laxman", "Hari", "Ramu"]),
        'age': pd.Series([19, 20, 21, 22, 25]),
        'Hindi': pd.Series([80, 90, 70, 92, 93]),
        'English': pd.Series([90, 80, 100, 60, 50])
        } 
df = pd.DataFrame(data)
print(df)

   Roll Number    Name  age  Hindi  English
0            1     Jay   19     80       90
1            2     Ram   20     90       80
2            3  Laxman   21     70      100
3            4    Hari   22     92       60
4            5    Ramu   25     93       50

### CSV(Comma seperated values) file read with DataFrame

In [36]:
salary_data = pd.read_csv(r'C:\Jay\Vs related files\TDS-Virtual-TA\Pandas\Salary_Data.csv')
df = pd.DataFrame(salary_data)
print(df)

    YearsExperience    Salary
0               1.1   39343.0
1               1.3   46205.0
2               1.5   37731.0
3               2.0   43525.0
4               2.2   39891.0
5               2.9   56642.0
6               3.0   60150.0
7               3.2   54445.0
8               3.2   64445.0
9               3.7   57189.0
10              3.9   63218.0
11              4.0   55794.0
12              4.0   56957.0
13              4.1   57081.0
14              4.5   61111.0
15              4.9   67938.0
16              5.1   66029.0
17              5.3   83088.0
18              5.9   81363.0
19              6.0   93940.0
20              6.8   91738.0
21              7.1   98273.0
22              7.9  101302.0
23              8.2  113812.0
24              8.7  109431.0
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [32]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [42]:
df = pd.read_csv(r'C:\Jay\Vs related files\TDS-Virtual-TA\Pandas\Salary_Data.csv')
df

    YearsExperience    Salary
0               1.1   39343.0
1               1.3   46205.0
2               1.5   37731.0
3               2.0   43525.0
4               2.2   39891.0
5               2.9   56642.0
6               3.0   60150.0
7               3.2   54445.0
8               3.2   64445.0
9               3.7   57189.0
10              3.9   63218.0
11              4.0   55794.0
12              4.0   56957.0
13              4.1   57081.0
14              4.5   61111.0
15              4.9   67938.0
16              5.1   66029.0
17              5.3   83088.0
18              5.9   81363.0
19              6.0   93940.0
20              6.8   91738.0
21              7.1   98273.0
22              7.9  101302.0
23              8.2  113812.0
24              8.7  109431.0
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [44]:
df.columns

Index(['YearsExperience', 'Salary'], dtype='object')

In [45]:
df.shape

(30, 2)

In [46]:
df.size

60

In [47]:
df.head() # it give first 5 rows by default

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [49]:
df.head(15) #Custom rows we want

    YearsExperience   Salary
0               1.1  39343.0
1               1.3  46205.0
2               1.5  37731.0
3               2.0  43525.0
4               2.2  39891.0
5               2.9  56642.0
6               3.0  60150.0
7               3.2  54445.0
8               3.2  64445.0
9               3.7  57189.0
10              3.9  63218.0
11              4.0  55794.0
12              4.0  56957.0
13              4.1  57081.0
14              4.5  61111.0

In [51]:
df.tail() #last five rows it gives me

    YearsExperience    Salary
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [52]:
df.tail(10)

    YearsExperience    Salary
20              6.8   91738.0
21              7.1   98273.0
22              7.9  101302.0
23              8.2  113812.0
24              8.7  109431.0
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [53]:
df.describe()

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.313333   76003.000000
std           2.837888   27414.429785
min           1.100000   37731.000000
25%           3.200000   56720.750000
50%           4.700000   65237.000000
75%           7.700000  100544.750000
max          10.500000  122391.000000

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  30 non-null     float64
 1   Salary           30 non-null     float64
dtypes: float64(2)
memory usage: 612.0 bytes

In [69]:
df = pd.read_csv(r'C:\Jay\Vs related files\TDS-Virtual-TA\Pandas\Restaurant.csv')
df.head()

,Rank,Restaurant,Content,Sales,YOY_Sales,Units,YOY_Units,Headquarters,Segment_Category
0,1,McDonald's,NaN,40412,4.9%,13846,-0.5%,NaN,Quick Service & Burger
1,2,Starbucks,NaN,21380,8.6%,15049,3.0%,NaN,Quick Service & Coffee Cafe
2,3,Chick-fil-A,While Popeyes got a lot of the chicken buzz in...,11320,13.0%,2470,5.0%,NaN,Quick Service & Chicken
3,4,Taco Bell,NaN,11293,9.0%,6766,2.7%,NaN,Quick Service & Mexican
4,5,Burger King,NaN,10204,2.7%,7346,0.2%,NaN,Quick Service & Burger

In [71]:
df.shape

(250, 9)

In [72]:
df.size

2250

In [73]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 250 entries, 0 to 249
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Rank              250 non-null    int64
 1   Restaurant        250 non-null    object
 2   Content           33 non-null     object
 3   Sales             250 non-null    int64
 4   YOY_Sales         250 non-null    object
 5   Units             250 non-null    int64
 6   YOY_Units         250 non-null    object
 7   Headquarters      52 non-null     object
 8   Segment_Category  250 non-null    object
dtypes: int64(3), object(6)
memory usage: 17.7+ KB

In [74]:
df.describe()

             Rank        Sales         Units
count  250.000000    250.00000    250.000000
mean   125.500000   1242.74000    850.076000
std     72.312977   3365.22882   2296.151659
min      1.000000    126.00000     13.000000
25%     63.250000    181.00000     85.000000
50%    125.500000    330.00000    207.000000
75%    187.750000    724.75000    555.250000
max    250.000000  40412.00000  23801.000000

In [132]:
df = pd.read_csv(r'C:\Jay\Vs related files\TDS-Virtual-TA\Pandas\sample.csv')
df.head()

   Roll No.  Physics  Chemistry  Maths  Computer
0         1     56.0       57.0   58.0      59.0
1         2     23.0       24.0   25.0      26.0
2         3     89.0       25.0   26.0      27.0
3         4     45.0       26.0   27.0      28.0
4         5     23.0       27.0   28.0      29.0

In [80]:
df.isnull() #Find that which value are null and which value are not null

    Roll No.  Physics  Chemistry  Maths  Computer
0      False    False      False  False     False
1      False    False      False  False     False
2      False    False      False  False     False
3      False    False      False  False     False
4      False    False      False  False     False
5      False    False       True  False     False
6      False    False      False  False     False
7      False    False      False  False     False
8      False     True      False  False     False
9      False    False      False  False     False
10     False     True      False  False     False
11     False    False       True  False     False
12     False    False      False  False     False
13     False    False       True   True     False
14     False     True      False  False     False
15     False    False      False  False     False
16     False    False      False  False     False
17     False    False      False  False     False
18     False    False      False  False     False
19     False    False      False  False     False
20     False    False      False  False     False
21     False    False      False  False     False
22     False    False      False  False     False
23     False    False      False  False     False
24     False    False       True   True     False
25     False    False      False  False     False
26     False    False      False  False     False
27     False    False      False  False      True
28     False    False      False  False     False
29     False    False      False  False     False

In [83]:
df.isnull().sum()

Roll No.     0
Physics      3
Chemistry    4
Maths        2
Computer     1
dtype: int64

In [85]:
df.isnull().sum().sum()

#There are 10 values which are null

np.int64(10)

In [86]:
df.shape

(30, 5)

### Dropping values for NAN numbers

In [108]:
df.shape

(30, 5)

In [111]:
df = df.dropna() # default axis = 0

#it will remove all the values which are null values

In [110]:
df.shape

(22, 5)

### Dropping column for NAN numbers

In [130]:
df = df.dropna(axis = 1)
df

    Roll No.
0          1
1          2
2          3
3          4
4          5
5          6
6          7
7          8
8          9
9         10
10        11
11        12
12        13
13        14
14        15
15        16
16        17
17        18
18        19
19        20
20        21
21        22
22        23
23        24
24        25
25        26
26        27
27        28
28        29
29        30

In [131]:
df.shape

(30, 1)

In [133]:
df

    Roll No.  Physics  Chemistry  Maths  Computer
0          1     56.0       57.0   58.0      59.0
1          2     23.0       24.0   25.0      26.0
2          3     89.0       25.0   26.0      27.0
3          4     45.0       26.0   27.0      28.0
4          5     23.0       27.0   28.0      29.0
5          6     90.0        NaN   29.0      30.0
6          7     12.0       13.0   14.0      15.0
7          8     78.0       14.0   15.0      16.0
8          9      NaN       15.0   16.0      17.0
9         10     45.0       16.0   17.0      18.0
10        11      NaN       17.0   18.0      19.0
11        12     88.0        NaN   19.0      20.0
12        13     22.0       23.0   24.0      25.0
13        14     90.0        NaN    NaN      42.0
14        15      NaN       43.0   43.0      43.0
15        16     44.0       44.0   44.0      44.0
16        17     45.0       45.0   45.0      45.0
17        18     46.0       46.0   46.0      46.0
18        19     47.0       47.0   47.0      47.0
19        20     48.0       48.0   48.0      48.0
20        21     49.0       49.0   49.0      49.0
21        22     50.0       50.0   50.0      50.0
22        23     51.0       51.0   51.0      51.0
23        24     52.0       52.0   52.0      52.0
24        25     53.0        NaN    NaN      53.0
25        26     54.0       33.0   33.0      54.0
26        27     55.0       34.0   34.0      55.0
27        28     56.0       35.0   35.0       NaN
28        29     57.0       36.0   36.0      66.0
29        30     58.0       37.0   37.0      43.0

In [139]:
a = df.dropna(how = 'any')
a.shape

(22, 5)

In [141]:
b = df.dropna(how  = "all")
b.shape

(30, 5)

In [142]:
df.dropna(inplace = True)

In [143]:
df.shape

(22, 5)

In [144]:
df = pd.read_csv(r'C:\Jay\Vs related files\TDS-Virtual-TA\Pandas\sample.csv')
df.head()

   Roll No.  Physics  Chemistry  Maths  Computer
0         1     56.0       57.0   58.0      59.0
1         2     23.0       24.0   25.0      26.0
2         3     89.0       25.0   26.0      27.0
3         4     45.0       26.0   27.0      28.0
4         5     23.0       27.0   28.0      29.0

In [148]:
df.isnull().sum().sum()

#There are 10 values which are null so we don't depend on dropna() fuction we will use fillna() fuction

np.int64(10)

In [149]:
df

    Roll No.  Physics  Chemistry  Maths  Computer
0          1     56.0       57.0   58.0      59.0
1          2     23.0       24.0   25.0      26.0
2          3     89.0       25.0   26.0      27.0
3          4     45.0       26.0   27.0      28.0
4          5     23.0       27.0   28.0      29.0
5          6     90.0        NaN   29.0      30.0
6          7     12.0       13.0   14.0      15.0
7          8     78.0       14.0   15.0      16.0
8          9      NaN       15.0   16.0      17.0
9         10     45.0       16.0   17.0      18.0
10        11      NaN       17.0   18.0      19.0
11        12     88.0        NaN   19.0      20.0
12        13     22.0       23.0   24.0      25.0
13        14     90.0        NaN    NaN      42.0
14        15      NaN       43.0   43.0      43.0
15        16     44.0       44.0   44.0      44.0
16        17     45.0       45.0   45.0      45.0
17        18     46.0       46.0   46.0      46.0
18        19     47.0       47.0   47.0      47.0
19        20     48.0       48.0   48.0      48.0
20        21     49.0       49.0   49.0      49.0
21        22     50.0       50.0   50.0      50.0
22        23     51.0       51.0   51.0      51.0
23        24     52.0       52.0   52.0      52.0
24        25     53.0        NaN    NaN      53.0
25        26     54.0       33.0   33.0      54.0
26        27     55.0       34.0   34.0      55.0
27        28     56.0       35.0   35.0       NaN
28        29     57.0       36.0   36.0      66.0
29        30     58.0       37.0   37.0      43.0

In [151]:
df.fillna(0)

    Roll No.  Physics  Chemistry  Maths  Computer
0          1     56.0       57.0   58.0      59.0
1          2     23.0       24.0   25.0      26.0
2          3     89.0       25.0   26.0      27.0
3          4     45.0       26.0   27.0      28.0
4          5     23.0       27.0   28.0      29.0
5          6     90.0        0.0   29.0      30.0
6          7     12.0       13.0   14.0      15.0
7          8     78.0       14.0   15.0      16.0
8          9      0.0       15.0   16.0      17.0
9         10     45.0       16.0   17.0      18.0
10        11      0.0       17.0   18.0      19.0
11        12     88.0        0.0   19.0      20.0
12        13     22.0       23.0   24.0      25.0
13        14     90.0        0.0    0.0      42.0
14        15      0.0       43.0   43.0      43.0
15        16     44.0       44.0   44.0      44.0
16        17     45.0       45.0   45.0      45.0
17        18     46.0       46.0   46.0      46.0
18        19     47.0       47.0   47.0      47.0
19        20     48.0       48.0   48.0      48.0
20        21     49.0       49.0   49.0      49.0
21        22     50.0       50.0   50.0      50.0
22        23     51.0       51.0   51.0      51.0
23        24     52.0       52.0   52.0      52.0
24        25     53.0        0.0    0.0      53.0
25        26     54.0       33.0   33.0      54.0
26        27     55.0       34.0   34.0      55.0
27        28     56.0       35.0   35.0       0.0
28        29     57.0       36.0   36.0      66.0
29        30     58.0       37.0   37.0      43.0